update/sys_soap_message_function_f1db6bd0dbb26200cf69f20ebf9619f4.xml

<?xml version="1.0" encoding="UTF-8"?>
<record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:soap1="http://schemas.microsoft.com/sharepoint/soap/">
   <soap:Header/>
   <soap:Body>
      <soap1:UpdateList>
         <!--Optional:-->
         <soap1:listName>${UpdateList.listName}</soap1:listName>
         <!--Optional:-->
         <soap1:listProperties>
            e
            <!--You may enter ANY elements at this point-->
            gero
         </soap1:listProperties>
         <!--Optional:-->
         <soap1:newFields>
            cum
            <!--You may enter ANY elements at this point-->
            sonoras
         </soap1:newFields>
         <!--Optional:-->
         <soap1:updateFields>
            aeoliam
            <!--You may enter ANY elements at this point-->
            quae
         </soap1:updateFields>
         <!--Optional:-->
         <soap1:deleteFields>
            ventos
            <!--You may enter ANY elements at this point-->
            verrantque
         </soap1:deleteFields>
         <!--Optional:-->
         <soap1:listVersion>${UpdateList.listVersion}</soap1:listVersion>
      </soap1:UpdateList>
   </soap:Body>
</soap:Envelope>]]></envelope>
        <function_name>ListsSoap12.UpdateList</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <soap_action>http://schemas.microsoft.com/sharepoint/soap/UpdateList</soap_action>
        <soap_endpoint>https://share.autodesk.com/_vti_bin/lists.asmx</soap_endpoint>
        <soap_message display_value="SharePoint">8b3baf5cdb726200cf69f20ebf961999</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>Niloy</sys_created_by>
        <sys_created_on>2016-10-27 14:33:05</sys_created_on>
        <sys_customer_update>true</sys_customer_update>
        <sys_id>f1db6bd0dbb26200cf69f20ebf9619f4</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>ListsSoap12.UpdateList</sys_name>
        <sys_package display_value="Donatenow" source="x_66281_donatenow">28f36102db222200cf69f20ebf9619f5</sys_package>
        <sys_policy/>
        <sys_replace_on_upgrade>false</sys_replace_on_upgrade>
        <sys_scope display_value="Donatenow">28f36102db222200cf69f20ebf9619f5</sys_scope>
        <sys_update_name>sys_soap_message_function_f1db6bd0dbb26200cf69f20ebf9619f4</sys_update_name>
        <sys_updated_by>Niloy</sys_updated_by>
        <sys_updated_on>2016-10-27 14:33:05</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
